1358484518/trusted-firmware-m/tfmcubeideproject/STM32CubeIDE/spe/api_ns/image_macros_to_preprocess_bl2.c
#define FLASH_LAYOUT_FOR_TEST
#define BL2
#define MCUBOOT_IMAGE_NUMBER 2
#define MCUBOOT_OVERWRITE_ONLY
#include "flash_layout.h"

enum bl2_image_attributes {
	RE_IMAGE_FLASH_ADDRESS_SECURE = (FLASH_BASE_ADDRESS+FLASH_AREA_0_OFFSET),
	RE_IMAGE_FLASH_ADDRESS_NON_SECURE = (FLASH_BASE_ADDRESS+FLASH_AREA_1_OFFSET),
	RE_BL2_BIN_ADDRESS = (FLASH_BASE_ADDRESS+FLASH_AREA_BL2_BIN_OFFSET),
#if defined(FLASH_BL2_NVCNT_AREA_OFFSET)
	RE_BL2_NVMCNT_ADDRESS = (FLASH_BASE_ADDRESS+FLASH_BL2_NVCNT_AREA_OFFSET),
#else
	RE_BL2_NVMCNT_ADDRESS = 0x0,
#endif
#if defined(FLASH_AREA_OTP_OFFSET)
	RE_BL2_PROVISION_ADDRESS = (FLASH_BASE_ADDRESS+FLASH_AREA_OTP_OFFSET),
#else
	RE_BL2_PROVISION_ADDRESS = 0x0,
#endif
	RE_BL2_BOOT_ADDRESS = (FLASH_BASE_ADDRESS+FLASH_AREA_BL2_OFFSET),
	RE_BL2_WRP_START = (FLASH_AREA_BL2_OFFSET),
	RE_BL2_WRP_END = (FLASH_AREA_BL2_NOHDP_OFFSET+FLASH_AREA_BL2_NOHDP_SIZE-0x1),
	RE_BL2_HDP_END = (FLASH_AREA_BL2_NOHDP_OFFSET-0x1),
	RE_IMAGE_FLASH_SECURE_UPDATE = (FLASH_BASE_ADDRESS+FLASH_AREA_2_OFFSET),
	RE_IMAGE_FLASH_NON_SECURE_UPDATE = (FLASH_BASE_ADDRESS+FLASH_AREA_3_OFFSET),
	RE_IMAGE_FLASH_UNUSED = (FLASH_BASE_ADDRESS+FLASH_AREA_3_OFFSET+FLASH_AREA_3_SIZE),
	RE_IMAGE_FLASH_SCRATCH = (FLASH_BASE_ADDRESS+FLASH_AREA_SCRATCH_OFFSET),
#if defined(FLASH_OTP_NV_COUNTERS_AREA_OFFSET)
	RE_IMAGE_FLASH_NV_COUNTERS = (FLASH_BASE_ADDRESS+FLASH_OTP_NV_COUNTERS_AREA_OFFSET),
#else
	RE_IMAGE_FLASH_NV_COUNTERS = (FLASH_BASE_ADDRESS+FLASH_NV_COUNTERS_AREA_OFFSET),
#endif
	RE_IMAGE_FLASH_NV_PS = (FLASH_BASE_ADDRESS+FLASH_PS_AREA_OFFSET),
	RE_IMAGE_FLASH_NV_ITS = (FLASH_BASE_ADDRESS+FLASH_ITS_AREA_OFFSET),
	RE_IMAGE_ENCRYPTED = 0x0
}